In [1]:
from bs4 import BeautifulSoup
import pandas as pd
import requests

In [2]:
page = requests.get('https://sos.ga.gov/elections/election_results/2010_0810/0020001.htm')
soup = BeautifulSoup(page.text, 'html.parser')

In [3]:
table = soup.find_all("table")[2]

In [4]:
df = pd.read_html(str(table), flavor='bs4')

In [5]:
df = df[1]

In [6]:
df.shape

(162, 8)

In [7]:
df.head(5)

          0     1              2                3                4   5   6   7
0       NaN   NaN  Deal  291,035  Handel  288,516  Totals  579,551 NaN NaN NaN
1       NaN   NaN          50.2%            49.8%           100.0% NaN NaN NaN
2    County   PPR            NaN              NaN              NaN NaN NaN NaN
3   APPLING  100%            939              508             1447 NaN NaN NaN
4  ATKINSON  100%            142              111              253 NaN NaN NaN

In [8]:
df = df[3:]

In [9]:
df.head(5)

          0     1    2    3     4   5   6   7
3   APPLING  100%  939  508  1447 NaN NaN NaN
4  ATKINSON  100%  142  111   253 NaN NaN NaN
5     BACON  100%  351  319   670 NaN NaN NaN
6     BAKER  100%  114   67   181 NaN NaN NaN
7   BALDWIN  100%  972  682  1654 NaN NaN NaN

In [10]:
df = df[df.columns[[0,2,3]]]

In [11]:
df.head(5)

          0    2    3
3   APPLING  939  508
4  ATKINSON  142  111
5     BACON  351  319
6     BAKER  114   67
7   BALDWIN  972  682

In [12]:
df.columns = ['county', 'Nathan Deal', 'Karen Handel']

In [13]:
df.tail(5)

        county Nathan Deal Karen Handel
157  WHITFIELD        3488         3069
158     WILCOX         396          368
159     WILKES         279          246
160  WILKINSON         268          166
161      WORTH         791          502

In [14]:
df = df.melt(id_vars=['county'])

In [15]:
df.columns = ['county', 'candidate', 'votes']

In [16]:
df.head()

     county    candidate votes
0   APPLING  Nathan Deal   939
1  ATKINSON  Nathan Deal   142
2     BACON  Nathan Deal   351
3     BAKER  Nathan Deal   114
4   BALDWIN  Nathan Deal   972

In [17]:
df['votes'] = df['votes'].astype(int)

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 318 entries, 0 to 317
Data columns (total 3 columns):
county       318 non-null object
candidate    318 non-null object
votes        318 non-null int64
dtypes: int64(1), object(2)
memory usage: 7.5+ KB

In [19]:
df['office'] = 'Governor'

In [20]:
df['district'] = ''

In [21]:
df['party'] = 'Republican'

In [22]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate     party
Karen Handel  Republican    288516
Nathan Deal   Republican    291035
Name: votes, dtype: int64

In [23]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

     county    office district       party    candidate  votes
0   APPLING  Governor           Republican  Nathan Deal    939
1  ATKINSON  Governor           Republican  Nathan Deal    142
2     BACON  Governor           Republican  Nathan Deal    351
3     BAKER  Governor           Republican  Nathan Deal    114
4   BALDWIN  Governor           Republican  Nathan Deal    972

In [24]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')